-------------------------------------
--  AUTO GENERATE BY CFG_EXPORTER  --
-------------------------------------
local cfg_item = {}

cfg_item.table_name = "cfg_item"

cfg_item.field_names = {
    id = 1,                                                                     -- 道具id
    name = 2,                                                                   -- 道具名称
    macro_name = 3,                                                             -- 宏定义
    icon = 4,                                                                   -- 图标资源
    description = 5,                                                            -- 道具描述
    item_type = 6,                                                              -- 道具类型
    item_sub_type = 7,                                                          -- 道具子类型
    price = 8,                                                                  -- 出售价格 配置格式：[(道具id,数量),...]
    quality_type = 9,                                                           -- 道具品质
}

cfg_item.rows = {
    [1] = {1, "钻石", "ITEM_DIAMOND", "1.png", "充值货币，可以通过充值、活动获得", 1, 1, {}, 5},
    [2] = {2, "金币", "ITEM_GOLD", "2.png", "常规货币", 1, 2, {}, 3},
    [3] = {3, "水晶", "RES_CRYSTAL", "3.png", "基础资源", 2, 1, {}, 1},
    [4] = {4, "金属", "RES_METAL", "4.png", "基础资源", 2, 2, {}, 1},
    [5] = {5, "石油", "RES_OIL", "5.png", "基础资源", 2, 3, {}, 1},
    [6] = {6, "粮食", "RES_FOOD", "6.png", "基础资源", 2, 4, {}, 1},
    [101] = {101, "传说召唤券", nil, "7.png", "可以在“传说英雄”卡池中免费进行一次召唤", 8, 1, {{1, 10}}, 5},
    [102] = {102, "霸业召唤券", nil, "8.png", "可以在霸业卡池“征服之军”、“整装待发”、“秩序重构”、“星战将起”、“战争号角”、“星球主宰”中免费进行一次召唤", 8, 2, {{2, 100}}, 3},
    [103] = {103, "传说英雄卡", nil, "9.png", "随机获得一个传说英雄", 7, 1, {{3, 100}, {4, 100}, {5, 100}, {6, 100}}, 4},
    [201] = {201, "人族传说卡", nil, "10.png", "随机获得一个人族的传说英雄", 7, 2, {{3, 500}}, 5},
    [202] = {202, "兽族传说卡", nil, "11.png", "随机获得一个兽族的传说英雄", 7, 3, {{4, 500}}, 5},
    [203] = {203, "机械传说卡", nil, "12.png", "随机获得一个机械族的传说英雄", 7, 4, {{5, 500}}, 5},
    [204] = {204, "神族传说卡", nil, "13.png", "随机获得一个神族的传说英雄", 7, 5, {{6, 500}}, 5},
}


cfg_item.ITEM_DIAMOND = 1                                                       -- 钻石
cfg_item.ITEM_GOLD = 2                                                          -- 金币
cfg_item.RES_CRYSTAL = 3                                                        -- 水晶
cfg_item.RES_METAL = 4                                                          -- 金属
cfg_item.RES_OIL = 5                                                            -- 石油
cfg_item.RES_FOOD = 6                                                           -- 粮食

return cfg_item
